app/views/orders/index.html.erb

SELECT "items".* FROM "items" WHERE 1=0
---
  <tr> <th>Name</th> <th>Price</th></tr>
  <% @order.items.each do |item| %>