app/controllers/categories_controller.rb

  def show
    @category = Category.find_by(name: params[:category_name].capitalize)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = $1 LIMIT $2  [["name", "Beverages"], ["LIMIT", 1]]